package com.mybot.setting.command_setting.command_set.wifi;

public class WiFiText {

    public static String wifiSteps1 = """
            🔴Крок 1️⃣. Перевірте налаштування і перезавантажте пристрій
            
              1️⃣Переконайтеся, що ви включили Wi-Fi📡 на устройстве.Отключіте і знову ввімкніть Wi-Fi.
              2️⃣Переконайтеся, що режим польоту вимкнено. Увімкніть його і знову виключіте.Подробнее про те, як ввімкнути чи вимкнути польоту ....
              3️⃣Натисніть і утримуйте кнопку живлення телефону протягом декількох секунд. Потім на екрані натисніть "Запустити знову" перезапустити.
              
            🔴Крок 2️⃣. Визначте тип проблеми
            
             - Телефон. Спробуйте підключитися до мережі Wi-Fi📡 за допомогою іншого пристрою, наприклад з ноутбука або іншого телефону. Якщо з'єднання встановлено, ймовірно, проблема пов'язана з вашим телефоном.
             - Мережа. Повторіть спробу з'єднання з іншою мережею Wi-Fi📡, наприклад в кафе або вдома у друзів. Якщо з'єднання встановлено, швидше за все, проблема пов'язана з вашою мережею.
             - Інтернет. Якщо пристрій підключається до мережі, але отримати доступ до Інтернету не вдається, ймовірно, проблема пов'язана з інтернет-з'єднанням.
             
            🟡Додаткові методи вирішення проблеми:
            
            - Видаліть мережу і додайте її повторно
            - Перезавантажте маршрутизатор або модем
            - Виконайте вхід для підключення до загальнодоступної мережі
            - Скиньте всі мережеві настройки
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;
}
