package com.mybot.setting.command_setting.command_set.system_memory;

public class SystemMemoryCommandText {

    public static String systemMemorySteps1 = """
            Якщо ви створили резервні копії фотографій і відео в Google Фото, можете видалити їх із телефона.
             Переглянути резервні копії можна в додатку. 
             Для цього потрібне з'єднання Wi-Fi або мобільний Інтернет.
            """;

    public static String systemMemorySteps2 = """
            Як закрити додатки, що не відповідають⚙☎
            Android керує пам'яттю, яку використовують додатки. Вам зазвичай не потрібно їх закривати. Однак якщо додаток не відповідає, спробуйте закрити його.
            Дізнайтеся, як вирішити проблеми з додатками, що не працюють.
                        
            Видаліть додатки, якими не користуєтеся🗑
            Видалені додатки можна завантажити на пристрій знову. Якщо ви купили додаток, платити за нього ще раз не потрібно.
                        
            Як очистити кеш і дані додатка🗑📂
            Зазвичай очистити кеш і дані додатка можна в налаштуваннях телефона. Меню налаштувань може відрізнятися залежно від моделі. Дізнайтеся більше у виробника пристрою.
                        
            1️⃣Опція "Очистити кеш" видаляє тимчасові дані. Деякі додатки можуть відкриватися повільніше під час наступного запуску.
            2️⃣Опція "Очистити пам'ять" назавжди видаляє всі дані додатка. Спершу рекомендуємо видаляти дані із самого додатка.
            
            Вийшло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;



}
