package com.mybot.setting.command_setting.command_set.slow_work;

public class SlowWorkText {

    public static String slowWorkSteps1 = """
            Методи вирішення:
            
            - Перезапустіть телефон📱
            - Перевірте, чи є оновлення ОС Android💿
            - Відновіть заводські налаштування телефона⚙
            - Зв'яжіться з виробником пристрою📞
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;
}
