package com.mybot.setting.command_setting.command_set.bluetooth;

public class BluetoothText {

    public static String bluetoothSteps1 = """
            А ось і відповідь😉
            
            Крок 1️⃣. Видаліть дані пристроїв із пам'яті телефона
            - Відкрийте додаток Налаштування.
            - Натисніть Підключені пристрої Потім Підключені раніше пристрої. Якщо цієї опції немає, натисніть Bluetooth.
            - Якщо ви бачите пристрої, якими зараз не користуєтеся, біля назви кожного з них натисніть значок Налаштування Потім Забути Потім Забути пристрій.
            - Якщо ви раніше створили пару з телефоном і автомобілем, біля назви автомобіля натисніть значок Налаштування Потім Забути Потім Забути пристрій.
            Крок 2️⃣. Видаліть дані телефонів із пам'яті автомобіля
            Щоб видалити дані телефонів, підключених до автомобіля, дотримуйтеся вказівок у посібнику до нього.
                        
            - Видаліть дані всіх телефонів, якими зараз не користуєтесь.
            - Якщо ви раніше підключали телефон до автомобіля, видаліть телефон.
            Крок 3️⃣. Оновіть список пристроїв, а потім підключіться
            
            Щоб дізнатися, як підключатися — через телефон чи автомобіль🚗, перегляньте посібник до автомобіля🏎.
                        
            1️⃣Як підключитися через телефон:
            - Перевірте, чи ваш автомобіль видимий і готовий до підключення.
            - Відкрийте додаток Налаштування.
            - Виберіть Підключені пристрої. Якщо з'явиться опція Bluetooth, натисніть її.
            - Виберіть Підключити новий пристрій Потім назва вашого автомобіля.
            2️⃣Як підключитися через автомобіль:
            - Відкрийте додаток Налаштування.
            - Натисніть Підключені пристрої. Якщо з'явиться опція Bluetooth, натисніть її.
            - Не закривайте цей екран.
            - У списку пристроїв автомобіля виберіть назву телефона.\s
            - Якщо потрібно, підтвердьте, що PIN-коди на екранах телефона й автомобіля збігаються.
            - Натисніть Дозволити доступ до контактів та історії викликів.
            - Натисніть Підключити, Прийняти або Підтвердити.
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;

    public static String bluetoothSteps2 = """
            1️⃣Не вдається створити пару з Wear OS: 
            - Якщо ви вперше підключаєте годинник до телефона, виконайте ці дії для вирішення проблем.
            - Якщо годинник відключається від телефона, виконайте ці дії для повторного під'єднання.
            2️⃣Не вдається підключити інші аксесуари: 
            - Перевірте, чи аксесуар видимий і готовий до підключення. Дотримуйтесь вказівок, що входять у комплект аксесуара.
                - Часто коли аксесуар готовий до підключення, на ньому світиться синій індикатор.
                - Перш ніж підключати деякі аксесуари (наприклад, обкладинку з клавіатурою), їх потрібно під’єднати до пристрою чи планшета.
            3️⃣Оновіть список аксесуарів.
            - Відкрийте додаток Налаштування.
            - Натисніть Підключені пристрої. Якщо з'явиться опція Bluetooth, натисніть її.
            - Натисніть Підключити новий пристрій Потім назва аксесуара.
            Якщо потрібно ввести код доступу до аксесуара, а у вас його немає, спробуйте ввести 0000 або 1234 (найпоширеніші коди доступу).
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;

    public static String bluetoothSteps3 = """
            ❗️Важливо: не в усіх автомобілях🚙 можна відтворювати музику через Bluetooth. Якщо проблема пов'язана з автомобілем, перегляньте посібник до нього.
                        
            1️⃣Переконайтеся, що на телефоні й аксесуарі чи в автомобілі ввімкнено звук🔈.
            2️⃣Переконайтеся, що на інших пристроях, підключених до телефона, не відтворюється музика.
            3️⃣Переконайтеся, що ввімкнено опцію Звук медіа-файлів:\s
            - Відкрийте додаток Налаштування.
            - Натисніть Підключені пристрої. Якщо з'явиться опція Bluetooth, натисніть її.
            - Якщо з'явиться опція Підключені раніше пристрої, натисніть її.
            - Біля назви автомобіля або аксесуара натисніть значок Налаштування.
            - Увімкніть Звук медіа-файлів.
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;

    public static String bluetoothSteps4 = """
            ❗️Важливо: не в усіх автомобілях можна здійснювати та приймати телефонні виклики через Bluetooth. Якщо проблема пов'язана з автомобілем, перегляньте посібник до нього.
                        
            1️⃣Переконайтеся, що на інші пристрої, підключені до вашого телефона, не надходять виклики.
            2️⃣Увімкніть Звук телефона🔈:
            - Відкрийте додаток Налаштування.
            - Виберіть Підключені пристрої. Якщо з'явиться опція Bluetooth, натисніть її.
            - Якщо з'явиться опція Підключені раніше пристрої, натисніть її.
            - Біля назви автомобіля або аксесуара натисніть значок Налаштування.
            - Увімкніть Звук телефона.
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;
}
