package com.mybot.setting.command_setting.command_set.battery;

public class BatteryText {


    public static String batterySteps1 = """
            А ось і відповідь😉
            
            Використовуйте адаптер живлення з комплекту свого телефона
            
            1️⃣Інші адаптери живлення й зарядні пристрої можуть заряджати повільно, не заряджати взагалі або пошкодити телефон чи акумулятор.
            
            Не допускайте перегрівання❗
            
            2️⃣Уникайте ситуацій, які можуть спричинити перегрівання телефона, особливо якщо акумулятор повністю заряджено.
            Через це пристрій може розряджатися значно швидше, навіть коли ви не використовуєте його. Це може пошкодити акумулятор.
            
            Заряджайте акумулятор за потреби🔋
            
            3️⃣Не потрібно перевіряти ємність акумулятора, повністю заряджаючи й розряджаючи його.
            Рекомендуємо періодично розряджати акумулятор до рівня заряду менше 10%, а потім повністю заряджати його вночі.
            """;

    public static String batterySteps2 = """
            А ось і відповідь😉
            
            Методи:
            
            1️⃣Увімкніть режим енергозбереження або зниженого енергоспоживання
            2️⃣Не виконуйте дії, які залишають екран увімкненим
            3️⃣Уникайте постійного підключення
            4️⃣Не виконуйте дії, пов'язані з обробкою великих обсягів даних
            5️⃣Як обмежити підключення й використання геоданих
            
            Допомогло?🙂
            Якщо ні, то натискай кнопку
            "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
            """;
}
