package com.mybot.setting.command_setting.command_set.factory_settings;

import com.mybot.setting.command_setting.Sms;

public class CommandFactorySettings implements Sms {

    public static String text;

    @Override
    public void sendSms() {
        text = """
                Як підготувати пристрій до скидання налаштувань⚙?
                                
                ❗Важливо: якщо скинути налаштування, з телефона буде видалено всі дані.
                                
                1️⃣Потрібно знати ім’я користувача та пароль облікового запису Google
                2️⃣Створіть резервну копію даних в обліковому записі Google
                3️⃣Зарядіть і підключіть телефон
                                
                Щоб відновити дані після скидання налаштувань телефона, потрібно розблокувати телефон або ввести пароль облікового запису Google.
                Так ви підтвердите, що налаштування скинули ви або хтось, кому ви довіряєте.
                                
                1️⃣Переконайтеся, що вам відомі дані облікового запису Google на телефоні.
                  - Відкрийте додаток Налаштування.
                  - Натисніть Облікові записи. Якщо опції "Облікові записи" немає, зверніться по допомогу до виробника пристрою.
                  - Ви побачите ім'я користувача облікового запису Google.
                2️⃣Переконайтеся, що вам відомий пароль облікового запису Google на телефоні.
                Для цього ввійдіть в обліковий запис на іншому пристрої або комп'ютері. 
                Якщо ви не пам'ятаєте пароль, скористайтеся цим інструментом.
                3️⃣Якщо ви налаштували блокування екрана, переконайтеся, що вам відомий PIN-код, ключ або пароль телефона.
                Якщо не вдається розблокувати телефон, дізнайтеся, що можна зробити.
                                
                Порада: якщо ви нещодавно скидали пароль облікового запису Google, зачекайте 24 години, перш ніж відновлювати заводські налаштування.
                                
                Вийшло?🙂
                Якщо ні, то натискай кнопку
                "Запросити допомогу оператора\uD83D\uDCDE" і він тобі обов'язково допоможе😉
                """;
    }
}
